Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/drugs_and_medicines/prescribed_drugs_and_medicines.html.txt.tmx
Source language: en
Languages: ga

source: Prescribed drugs and medicines
ga: Drugaí agus cógais ordaithe

source: If you are ordinarily resident, you are entitled to either free or subsidised approved prescribed drugs and medicines and certain medical and surgical aids and appliances
ga: Má tá gnáthchónaí ort, bíonn tú i dteideal drugaí agus cógais faofa ordaithe atá saor in aisce nó fóirdheonaithe mar aon le háiseanna agus le fearais áirithe mháinliachta a fháil

source: Prescribed drugs and medicines are covered by the medical card
ga: Tá drugaí agus cógais ordaithe cumhdaithe ag an gcárta leighis

source: Under the Long Term Illness Scheme, people suffering from certain conditions can get free drugs, medicines and medical and surgical appliances for the treatment of that condition
ga: Faoin Scéim Breoiteachta Fhadtéarmach, féadfaidh daoine a bhíonn thíos le roinnt riochtaí drugaí, cógais agus fearais leighis agus mháinliachta saor in aisce a fháil chun cóireáil a chur ar an riocht siúd

source: The Health Amendment Act Card provides drugs and medicines for people who have contracted Hepatitis C directly or indirectly through the administration of blood products or transfusions
ga: Soláthraíonn an Cárta faoin Acht Sláinte (Leasú) drugaí agus cógais do dhaoine a rinne Heipitíteas C a tholgadh go díreach nó go hindíreach trí tháirge fola nó fuilaistriúcháin a riar

source: If you are not covered by the medical card or any of the schemes listed above, you can register for the Drugs Payment Scheme which limits the monthly cost of prescription medicines
ga: Mura bhfuil tú cumhdaithe ag an gcárta leighis nó ag aon cheann de na scéimeanna a liostaítear thuas, féadfaidh tú clárú don Scéim Íocaíochta Drugaí a chuireann teorainn ar chostas míosúil cógais oidis

source: Prescribed drugs and medicines are eligible for tax relief on medical expenses
ga: Tá drugaí agus cógais ordaithe incháilithe d’fhaoiseamh cánach ar chostais leighis

source: In general, approved prescribed drugs and medicines are provided by the retail pharmacy (chemist's shop)
ga: Go ginearálta, cuireann an chógaslann mhiondíola (siopa an phoitigéara) na drugaí agus na cógais cheadaithe ordaithe ar fáil

source: Virtually all pharmacies have agreements with the Health Service Executive (HSE) to provide services under the Primary Care Reimbursement Services scheme
ga: Tá ag nach mór gach cógaslann comhaontuithe le FSS le seirbhísí a chur ar fáil faoin Scéim Seirbhís Aisíoctha Cúraim Phríomhúil

source: GPs may provide drugs and medicines directly to patients if the GP has only one practice centre and it is three miles or more from the nearest retail pharmacist
ga: Is féidir le LGanna drugaí agus cógais a sholáthar go díreach d’othair má tá ag an LG ach ionad amháin cleachtais agus go bhfuil sé suite trí mhíle nó níos faide ón bpoitigéir miondíola is cóngaraí

source: Doctors who dispense drugs and medicines under these arrangements are sometimes called dispensing doctors
ga: Glaoitear “dochtúirí dáilte” uaireanta ar dhochtúirí a dhéanann drugaí agus cógais a dháileadh faoi na socruithe seo

source: Hospitals and other specialist institutions may also provide drugs, medicines and aids and appliances directly
ga: Ina theannta sin, is féidir le hospidéil agus le hinstitiúidí eile speisialaithe drugaí, cógais, áiseanna agus fearais a sholáthar go díreach

source: The rules about when drugs and medicines are free or subsidised are the same regardless of who provides them
ga: Tá na rialacha faoi cathain a bhíonn na drugaí agus na cógais saor in aisce nó fóirdheonaithe mar an gcéanna, is cuma cé a sholáthraíonn iad

source: Approved drugs and medicines
ga: Drugaí agus cógais cheadaithe

source: There is a system in place for the approval and control of drugs
ga: Tá córas i bhfeidhm do cheadú agus do rialú drugaí

source: The Health Products Regulatory Authority (HPRA) is the authority with responsibility for licensing medicines and testing them for safety, quality and efficacy
ga: Is iad An tÚdarás Rialála Táirgí Sláinte an t-údarás ag a bhfuil an fhreagracht as cógais a cheadúnú agus iad a thástáil i dtaobh sábháilteachta, cáilíochta agus éifeachtúlachta de

source: Drugs must be approved by the HPRA before they can be sold at all
ga: Ní mór go gceadaíonn An tÚdarás Rialála Táirgí Sláinte drugaí sular féidir iad a dhíol in aon chor

source: HPRA approval does not necessarily mean that the drugs and medicines will be approved for the free and subsidised schemes
ga: Ni hé go gciallaíonn ceadú An tÚdarás Rialála Táirgí Sláinte go gceadófar na drugaí agus na gcógais do na scéimeanna drugaí agus cógas saor in aisce

source: There are other factors involved in the approval process, including costs
ga: Tá tosca eile i gceist sa phróiseas ceadaithe, lena n-áirítear costais

source: Free or subsidised schemes
ga: Scéimeanna saor in aisce nó fóirdheontais

source: The HSE Primary Care Reimbursement Service provides a list of medicines or aids provided under the medical card or Drugs Payment Scheme
ga: Soláthraíonn Seirbhís Aisíocaíochta Cúraim Phríomhúil FSS liosta de na cógais nó de na háiseanna a sholáthraítear faoin Scéim cártaí leighis nó Íocaíochta Drugaí

source: These products are approved for the schemes by the HSE
ga: Tá na táirgí seo faofa do na scéimeanna ag FSS

source: Medical card holders who are prescribed items that are not on this list can apply to have them covered under a discretionary hardship scheme
ga: Féadfaidh sealbhóirí cárta leighis a n-ordaítear earraí dóibh nach bhfuil ar an liosta seo iarratas a dhéanamh go ndéanfar iad a chumhdach faoi scéim lánroghnach chruatain

source: If you have a medical card and an item on your prescription is not covered by it, your pharmacist can apply on your behalf to the Local Health Office to have the item covered by the hardship scheme
ga: Má tá cárta leighis agat agus mura gcumhdaíonn sé earra ar d’oideas, féadfaidh do chógaiseoir iarratas a dhéanamh thar do cheann leis an Oifig Sláinte Áitiúil go gcumhdófar an t-earra faoin scéim chruatain

source: If the hardship scheme does not cover the medicine and you have to pay for it, you may want to check with your doctor to see if there is an alternative
ga: Mura gcumhdaíonn an scéim cruatain an cógas agus más gá duit íoc as, b’fhéidir gur mhaith leat seiceáil le do dhochtúir féachaint an bhfuil cógas eile ann a d’fhéadfá a fháil ina ionad

source: You can get more information about the scheme from your pharmacist
ga: Féadfaidh tú níos mó faisnéise a fháil faoin scéim ó do chógaiseoir

source: Certain items that can be bought over the counter are excluded from the free or subsidised schemes
ga: Ní chuimsítear earraí áirithe is féidir a cheannach ag an gcuntar faoi na scéimeanna

source: Examples of such products are vitamin supplements, products for the treatment of baldness, and some painkillers, such as Panadol, Disprin, Solpadeine and Nurofen
ga: Samplaí de táirgí siúd iad pianmhúcháin, ar nós Panadol, Disprin, Solpadeine and Nurofen mar aon le forbhia agus táirgí vitimíní chun cóireáil a chur ar cheann maol

source: Generic drugs and reference pricing
ga: Drugaí cineálacha agus praghsáil tagartha

source: The Health (Pricing and Supply of Medical Goods) Act 2013 allows pharmacists to substitute different versions of some prescribed medicines – often less expensive generic versions of brand name medicines
ga: Ceadaíonn an tAcht Sláinte (Praghsáil agus Soláthar Earraí Leighis), 2013 do phoitigéirí leaganacha éagsúla de roinnt cógais oidis a chur in ionad cógais eile – de ghnáth is leaganacha cineálacha iad seo de chógais ar a bhfuil ainm branda nach mbíonn chomh costasach céanna

source: The medicines must be included in a list of interchangeable drugs published by the HPRA
ga: Ní mór do na cógais a bheith san áireamh i liosta de dhrugaí in-idirmhalartaithe a fhoilsíonn An tÚdarás Rialála Táirgí Sláinte

source: The HPRA has published an information leaflet about generic medicines (pdf)
ga: D’fhoilsigh An tÚdarás Rialála Táirgí Sláinte leabhrán faisnéise faoi chógais chineálacha (pdf)

source: The HSE sets one price that it will pay for each group of interchangeable medicines
ga: Leagann FSS praghas amháin amach a íocfaidh siad do gach grúpa de chógais in-idirmhalartaithe

source: This is known as the reference price
ga: Tugtar an praghas tagartha air seo

source: The phased introduction of reference pricing began from 1 November 2013
ga: Cuireadh tús le tabhairt isteach céimnithe praghsáil tagartha an 1 Samhain 2013

source: If you have a medical card, the HSE will pay the reference price for any interchangeable medicine
ga: Má tá cárta leighis agat, íocfaidh FSS an praghas tagartha ar aon chógas in-idirmhalartaithe

source: If you choose to buy a more expensive version of the medicine, you must pay the difference between the reference price and the retail price
ga: Má roghnaíonn tú chun leagan níos costasaí den chógas a cheannach, ní mór duit an difríocht a íoc idir an praghas tagartha agus an praghas miondíola

source: If you are on the Drugs Payment Scheme the HSE will use the reference price to calculate your monthly drugs costs
ga: Má tá tú páirteach sa Scéim Íocaíochta Drugaí, úsáidfidh FSS an praghas tagartha chun do chostais mhíosúla drugaí a ríomh

source: If you choose a more expensive version of a medicine that is covered you must pay the extra cost
ga: Má roghnaíonn tú leagan níos costasaí de chógas atá cuimsithe, ní mór duit an costas breise a íoc

source: If you need a particular brand of medicine for medical reasons your doctor can write 'Do not Substitute' on the prescription and you will not have to pay extra if it costs more than the reference price
ga: Má theastaíonn branda ar leith de chógas uait ar chúiseanna leighis, féadfaidh do dhochtúir ‘Ná Cuir in Ionaid’ a scríobh ar an oideas agus ní bheidh ort aon airgead breise a íoc má chosnaíonn sé níos mó ná an praghas tagartha

source: Regulations were introduced under the Irish Medicines Board Act 2006 which allow nurses the authority to prescribe medicines
ga: Tugadh isteach rialacháin faoin Acht um Bord Leigheasra Éireann, 2006 a thugann d’altraí an t-údarás chun cógais a ordú

source: Previously, only doctors had authority to prescribe
ga: Roimhe seo, ní raibh ach ag dochtúirí an t-údarás le hordú a dhéanamh

source: Individual nurse prescribers must be employed by a health service provider and may only prescribe the drugs relevant to the setting in which they are employed
ga: Ní mór d’oideasóirí aonair altra a bheith fostaithe ag soláthróirí seirbhís sláinte agus ní féidir leo ach na drugaí a ordú a bhaineann leis an suíomh ina bhfuil siad fostaithe

source: There are specific restrictions on certain controlled drugs
ga: Beidh srianta sonracha i gceist ar dhrugaí áirithe rialaithe
